
/*
  Localizable.string.strings
  WeChatMac

  Created by Justin Yim on 2/16/15.
  Copyright (c) 2015 Tencent. All rights reserved.
*/

"App.Name" = "WeChat";

"Common.Dialog.OK" = "ตกลง";
"Common.Dialog.Cancel" = "ยกเลิก";
"Common.Navigation.Back" = "ย้อนกลับ";
"Common.Cancel" = "ยกเลิก";
"Common.Delete" = "ลบ";
"Common.Send" = "ตกลง";

// Main Window
"MainWindow.Title.Format" = "WeChat (%@)";
"MainWindow.Title.NoChildTitle" = "WeChat";

// Common Errors
"Common.System.GenericErrorHeading" = "ระบบไม่ว่าง";
"Common.System.GenericErrorBody" = "ลองอีกครั้งภายหลัง";
"Common.System.Busy" = "ระบบไม่ว่าง ลองอีกครั้งในภายหลัง";
"Common.Dialog.SaveError.Heading" = "เกิดข้อผิดพลาดขณะกำลังบันทึกไฟล์นี้";
"Common.Dialog.SaveError.Body" = "ตรวจสอบว่าคุณมีพื้นที่ดิสก์เพียงพอและมีสิทธิ์ในการบันทึกไปยังที่นั่น";

// Chatlog backup
"Chatlog_Backup_Backup_Connecting_Title" = "กำลังเชื่อมต่อโทรศัพท์…";
"Chatlog_Backup_Backup_Connecting_Desc" = "กำลังเชื่อมต่อโทรศัพท์และคอมพิวเตอร์กับเครือข่่ายเดียวกัน";
"Chatlog_Backup_Backup_Connected_Title" = "เปิด WeChat บนโทรศัพท์";
"Chatlog_Backup_Backup_Connected_Desc" = "เลือกการสนทนาที่จะสำรองข้อมูล";
"Chatlog_Backup_Backup_Prepare_Title" = "กำลังเตรียมข้อมูล...";
"Chatlog_Backup_Backup_Prepare_Desc" = "สำหรับเครือข่ายที่น่าเชื่อถือยิ่งขึ้น อย่าปิด WeChat";
"Chatlog_Backup_Backup_Transfer_Title" = "กำลังสำรองข้อมูลการสนทนา %lld/%lld รายการ (%@)";
"Chatlog_Backup_Backup_Transfer_Desc" = "สำหรับเครือข่ายที่น่าเชื่อถือยิ่งขึ้น อย่าปิด WeChat";
"Chatlog_Backup_Backup_Import_Data_Title" = "กำลังนำเข้าการสำรองข้อมูล";
"Chatlog_Backup_Backup_Import_Data_Desc" = "อย่าปิดหน้าเพื่อให้การสำรองข้อมูลสมบูรณ์";
"Chatlog_Backup_Backup_Finish_Title" = "เสร็จสมบูรณ์";
"Chatlog_Backup_Backup_Finish_Desc" = "สำรองข้อมูลแล้ว %lld/%lld รายการ";

"Chatlog_Backup_Backup_Finish_Btn_Title" = "เสร็จสิ้น";
"Chatlog_Backup_Backup_Continue_Btn_Title" = "ดำเนินการต่อ";
"Chatlog_Backup_Backup_Terminate_Btn_Title" = "ยุติการทำงาน";
"Chatlog_Backup_Backup_End_Btn_Title" = "สำรองข้อมูลเรียบร้อยแล้ว";
"Chatlog_Backup_Backup_Retry_Btn_Title" = "ลองใหม่";
"Chatlog_Backup_Backup_Confirm_Btn_Title" = "ตกลง";
"Chatlog_Backup_Backup_Cancel_Btn_Title" = "ยกเลิก";
"Chatlog_Backup_Backup_Return_Btn_Title" = "ย้อนกลับ";

"Chatlog_Backup_Backup_Transfer_Disconnect_Title" = "กำลังสำรองข้อมูลการสนทนา %lld/%lld รายการ (%@)";
"Chatlog_Backup_Backup_Transfer_Disconnect_Hint" = "ยกเลิกการเชื่อมต่อเครือข่ายแล้ว ให้เชื่อมต่อโทรศัพท์กับคอมพิวเตอร์กับเครือข่ายเดียวกันและถ่ายโอนต่อ";
"Chatlog_Backup_Backup_Connect_Timeout_Title" = "การเชื่อมโยงหมดเวลา ลองอีกครั้ง";
"Chatlog_Backup_Backup_Connect_Timeout_Hint" = "หลังจากการเชื่อมต่อโทรศัพท์และคอมพิวเตอร์กับเครือข่่ายเดียวกัน";
"Chatlog_Backup_Backup_Transfer_Unfinish_Title" = "ถ่ายโอนการสนทนาแล้ว %lld/%lld รายการ…";
"Chatlog_Backup_Backup_Transfer_Unfinish_Hint" = "ถ่ายโอนไม่สำเร็จ ให้เชื่อมต่อโทรศัพท์กับคอมพิวเตอร์กับเครือข่ายเดียวกันและสำรองข้อมูลต่อ";
"Chatlog_Backup_Backup_Transfer_Lackspace_Title" = "สำรองข้อมูลสิ้นสุด เนื่องจากพื้นที่เก็บข้อมูลในคอมพิวเตอร์ไม่เพียงพอ";
"Chatlog_Backup_Backup_Transfer_Lackspace_Hint" = "สำรองข้อมูลแล้ว %lld/%lld รายการ";
"Chatlog_Backup_Backup_Transfer_Terminate_Title" = "สำรองเรียบร้อยแล้ว";
"Chatlog_Backup_Backup_Transfer_Terminate_Hint" = "สำรองข้อมูลแล้ว %lld/%lld รายการ";
"Chatlog_Backup_Backup_Transfer_UserCancel_Title" = "สำรองข้อมูลเรียบร้อยแล้ว";
"Chatlog_Backup_Backup_Transfer_UserCancel_Desc" = "ไม่สามารถล้างข้อมูลที่ถูกสำรองเอาไว้ได้ แต่คุณจะต้องสำรองข้อมูลอีกครั้งในคราวหน้า";

// Chatlog recover
"Chatlog_Backup_Recover_Loading" = "กำลังโหลด…";
"Chatlog_Backup_Recover_Record_Selection" = "เลือกการสนทนาที่จะกู้คืน";
"Chatlog_Backup_Recover_Connecting_Title" = "กำลังเชื่อมต่อโทรศัพท์…";
"Chatlog_Backup_Recover_Connecting_Desc" = "กำลังเชื่อมต่อโทรศัพท์และคอมพิวเตอร์กับเครือข่่ายเดียวกัน";
"Chatlog_Backup_Recover_Connected_Title" = "เปิด WeChat บนโทรศัพท์";
"Chatlog_Backup_Recover_Connected_Desc" = "คลิก ตกลง เพื่อถ่ายโอน";
"Chatlog_Backup_Recover_Prepare_Title" = "กำลังเตรียม...";
"Chatlog_Backup_Recover_Prepare_Desc" = "สำหรับเครือข่ายที่น่าเชื่อถือยิ่งขึ้น อย่าปิด WeChat";
"Chatlog_Backup_Recover_Transfer_Title" = "กำลังถ่ายโอนการสนทนา %lld/%lld รายการ (%@)";
"Chatlog_Backup_Recover_Transfer_Desc" = "สำหรับเครือข่ายที่น่าเชื่อถือยิ่งขึ้น อย่าปิด WeChat";
"Chatlog_Backup_Recover_Finish_Title" = "ถ่ายโอนเสร็จสิ้น คืนค่าบนโทรศัพท์ต่อ";
"Chatlog_Backup_Recover_Finish_Desc" = "ถ่ายโอนการสนทนาแล้ว %lld/%lld รายการ";
"Chatlog_Backup_Recover_Session_Title" = "เลือกการสนทนาที่จะกู้คืน";
"Chatlog_Backup_Recover_Session_SelectAll" = "เลือกทั้งหมด";
"Chatlog_Backup_Recover_Session_Selected" = "เลือก %@ รายการ";

"Chatlog_Backup_Recover_Finish_Btn_Title" = "เสร็จสิ้น";
"Chatlog_Backup_Recover_Continue_Btn_Title" = "ดำเนินการต่อ";
"Chatlog_Backup_Recover_Terminate_Btn_Title" = "จบ";
"Chatlog_Backup_Recover_Retry_Btn_Title" = "ลองใหม่";
"Chatlog_Backup_Recover_Confirm_Btn_Title" = "ตกลง";
"Chatlog_Backup_Recover_Cancel_Btn_Title" = "ยกเลิก";
"Chatlog_Backup_Recover_Return_Btn_Title" = "ย้อนกลับ";

"Chatlog_Backup_Recover_Transfer_Disconnect_Title" = "กำลังถ่ายโอนการสนทนา %lld/%lld รายการ (%@)";
"Chatlog_Backup_Recover_Transfer_Disconnect_Hint" = "ยกเลิกการเชื่อมต่อเครือข่ายแล้ว ให้เชื่อมต่อโทรศัพท์กับคอมพิวเตอร์กับเครือข่ายเดียวกันและถ่ายโอนต่อ";
"Chatlog_Backup_Recover_Connect_Timeout_Title" = "การเชื่อมโยงหมดเวลา ลองอีกครั้ง";
"Chatlog_Backup_Recover_Connect_Timeout_Hint" = "หลังจากการเชื่อมต่อโทรศัพท์และคอมพิวเตอร์กับเครือข่่ายเดียวกัน";
"Chatlog_Backup_Recover_Transfer_Unfinish_Title" = "ถ่ายโอนการสนทนาแล้ว %lld/%lld รายการ…";
"Chatlog_Backup_Recover_Transfer_Unfinish_Hint" = "โทรศัพท์และคอมพิวเตอร์จะต้องเชื่อมต่อกับ Wi-Fi เดียวกัน เพื่อถ่ายโอนบันทึกการสนทนาต่อ";
"Chatlog_Backup_Recover_Transfer_Lackspace_Title" = "ถ่้ายโอนสิ้นสุด เนื่องจากพื้นที่เก็บข้อมูลในโทรศัพท์ไม่เพียงพอ";
"Chatlog_Backup_Recover_Transfer_Lackspace_Hint" = "ถ่ายโอนการสนทนาแล้ว %lld/%lld รายการ";
"Chatlog_Backup_Recover_Transfer_Terminate_Title" = "ถ่ายโอนสิ้นสุด";
"Chatlog_Backup_Recover_Transfer_Terminate_Hint" = "ถ่ายโอนการสนทนาแล้ว %lld/%lld รายการ";
"Chatlog_Backup_Recover_Transfer_UserCancel_Title" = "จบ";
"Chatlog_Backup_Recover_Transfer_UserCancel_Desc" = "ถ้าคุณหยุดการถ่ายโอน คุณจะจำเป็นต้องคืนค่าอีกในครั้งถัดไป แต่การสนทนาที่ถ่ายโอนแล้วจะไม่ถูกล้าง";
"Chatlog_Backup_Entrance_Recover_NoData_Title" = "ไม่มีการสนทนา";
"Chatlog_Backup_Entrance_Recover_NoData_Desc" = "ไม่มีการสำรองข้อมูลที่จะกู้คืน สำรองข้อมูลการสนทนาเสียก่อน";
"Chatlog_Backup_Recover_Transfer_UserCancel_Title" = "停止传输";
"Chatlog_Backup_Recover_Transfer_UserCancel_Desc" = "停止聊天记录传输，下次恢复将会重新开始，已传输到手机的聊天不会自动清除";

// Manage Exist Backup
"Chatlog_Backup_Manager_Exist_Backup_Name_Column_Title" = "สำรองข้อมูลชื่อ";
"Chatlog_Backup_Manager_Exist_Backup_FirstBackupTime_Column_Title" = "เวลาสำรองข้อมูลแรก";
"Chatlog_Backup_Manager_Exist_Backup_LastBackupTime_Column_Title" = "เวลาสำรองข้อมูลสุดท้าย";
"Chatlog_Backup_Manager_Exist_Backup_Operation_Column_Title" = "การดำเนินการ";
"Chatlog_Backup_Manager_Recover_Backup_Selection_Window_Title" = "เลือกการสำรองข้อมูลที่จะกู้คืน";
"Chatlog_Backup_Manager_Exist_Backup_Selection_Window_Title" = "จัดการ";
"Chatlog_Backup_Manager_Exist_Backup_No_Backups" = "ยังไม่ได้สำรองข้อมูลเลย";
"Chatlog_Backup_Manager_Exist_Backup_Delete_Alert_Title" = "ลบการสำรองข้อมูล";
"Chatlog_Backup_Manager_Exist_Backup_Delete_Alert_Message" = "ไม่สามารถกู้คืนการสำรองข้อมูลได้เมื่อลบแล้ว ลบเลยหรือไม่";

// Chatlog entrance
"Chatlog_Backup_Entrance_Backup_Desc" = "สำรองข้อมูลบน PC";
"Chatlog_Backup_Entrance_Recover_Desc" = "คืนค่าบนโทรศัพท์";
"Chatlog_Backup_Entrance_Manage_Desc" = "จัดการไฟล์สำรองข้อมูล";


// Login
"Login.WindowTitle" = "ล็อกอิน";
"Login.ScanToLogin.Title" = "สแกนเพื่อล็อกอินเข้า WeChat";
"Login.DidScan.Title" = "สแกนเรียบร้อยแล้ว";
"Login.ScanToLogin" = "สแกนรหัสนี้โดยใช้ WeChat บนโทรศัพท์ขงอคุณ";
"Login.Scan.Help" = "เปิด WeChatบนโทรศัพท์ของคุณ แล้วเลือก > สแกน QR โค้ด";
"Login.Not.On.WeChat" = "ยังไม่มี WeChat เหรอ";
"Login.Waiting.Confirmation" = "กำลังรอการยืนยัน";
"Login.ConfirmOnYourPhone" = "ยืนยันล็อกอินบนโทรศัพท์ของคุณ";
"Login.LoggingIn" = "กำลังล็อกอิน...";
"Login.LoggingInFirstTime" = "กำลังล็อกอิน...";
"Login.Alert.Title" = "WeChat";
"Login.Alert.WrongUsrPass" = "บัญชีหรือรหัสผ่านไม่ถูกต้อง กรอกอีกครั้ง";
"Login.Alert.OK" = "ตกลง";
"Login.Refresh" = "รีเฟรช";
"Login.Alert.UpdateCert" = "เซสชั่นของคุณหมดอายุแล้ว กรุณาเข้าสู่ระบบอีกครั้ง";
"Login.SwitchAccount" = "สลับบัญชี";

"Login.Intro.Heading" = "WeChat สำหรับ Mac ต้องใช้โทรศัพท์ของคุณเพื่อเข้าสู่ระบบ\n";
"Login.Intro.Subheading" = "โปรดล็อกอินเข้า Web WeChat";
"Login.Intro.StartButton" = "ล็อกอิน";

"Login.Intro.ExplanationFormat" = "หากคุณไม่มี WeChat บนโทรศัพท์ คุณสามารถ %@";
"Login.Intro.ExplanationLinkText" = "เรียนรู้เพิ่มเติม ที่นี่";
"Login.Intro.ExplanationLinkURL" = "http://www.wechat.com/en/download.html";


"Login.AlphaVersion.Title" = "เวอร์ชั่นทดลอง";
"Login.AlphaVersion.Description" = "คุณต้องสมัครเพื่อใช้งานเวอร์ชั่นเบต้านี้";
"Login.AlphaVersion.Apply" = "ใช้";
"Login.AlphaVersion.Cancel" = "ยกเลิก";
"Login.Failed.WrongPassword" = "ไม่สามารถล็อกอิน ลองอีกครั้งในภายหลัง";

"Login.Initializing.Title" = "ยืนยันแล้ว";
"Login.Initializing.Data" = "กำลังเตรียมตัวล็อกอิน...";
"Login.Init.Failed.Title" = "WeChat";
"Login.Init.Failed.Desc" = "ไม่สามารถล็อกอินได้";
"Login.Failed.Key.Info" = "ระบบไม่ว่าง ล็อกอินอีกครั้ง";
"Login.AuthAnOtherPlace" = "หมดเวลาล็อกอิน ล็อกอินอีกครั้ง";
"Login.Alpha.Version.Error" = "ไม่สามารถล็อกอินในเวอร์ชันเบต้าได้ ดาวน์โหลดรุ่นที่เป็นทางการจาก App Store";

// Tab
"Tabbar.Chats" = "แชท";
"Tabbar.Contacts" = "ผู้ติดต่อ";
"Tabbar.Favorites" = "รายการโปรด";
"Tabbar.OA" = "บัญชีทางการ";

// Tab tooltips
"Tabbar.Chats.Tooltip" = "WeChat";
"Tabbar.Contacts.Tooltip" = "ผู้ติดต่อ";
"Tabbar.Favorites.Tooltip" = "รายการโปรด";
"Tabbar.OA.Tooltip" = "การอ่าน";
"Tabbar.Preferences.Tooltip" = "เกม";

"Tabbar.Add.Chats.Tooltip" = "สนทนาใหม่";
"Tabbar.Add.Fav.Tooltip" = "รายการโปรด";

// Preferences
"Tabbar.Preferences.Settings" = "เกม";
"Tabbar.Preferences.ChatlogBackup" = "สำรองข้อมูลและคืนค่า";

// Global Menu
"Global.Menu.CheckForUpdates" = "ตรวจสอบอัปเดต...";
"Global.Menu.TechSupport" = "การสนับสนุนทางเทคนิค";

// Plugin
"Common_OfficialNickName" = "WeChat Team";
"Official_FileHelper_NickName" = "ส่งไฟล์";
"Official_BrandSessionHolder_NickName" = "บัญชีทางการ"; // 后来把订阅号和服务号都放到一起了
"Official_Brand_Template_Msg_Holder_UserName" = "การแจ้งเตือนการบริการ";
"Contacts_Plugin_QQMail_Nickname" = "อีเมล์ QQ";
"Contacts_Plugin_QQOfflineMsg_Nickname" = "ข้อความ QQ";
"Contacts_Plugin_PrivateMsg_Nickname" = "ข้อความ Weibo";
"Contacts_Plugin_FloatBottle_Nickname" = "ข้อความในขวด";
"Contacts_Plugin_FriendAssist_Nickname" = "เพื่อนใหม่";
"Contacts_Plugin_MediaNote_Nickname" = "วอยซ์เมโม";
"Contacts_Plugin_SyncAsist_Nickname" = "ซิงค์ผู้ติดต่อ";
"Contacts_Plugin_LBS_Nickname" = "คนที่อยู่ใกล้ ๆ";
"Contacts_Plugin_Shake_Nickname" = "Shake";
"Contacts_Plugin_Facebook_Nickname" = "Facebook";
"Contacts_Plugin_QQFriend" = "รายชื่อ QQ";
"Contacts_Plugin_Reader" = "ข่าว Tencent";
"Contacts_Plugin_Album" = "Moments";
"Contacts_Plugin_MassSend" = "ข้อความออกอากาศ";
"Contacts_Plugin_Blog" = "ฟีด Weibo";
"Contacts_Plugin_Voip"  = "วิดีโอคอล";
"Contacts_Plugin_VoiceVoip" = "วอยซ์คอล";
"Contacts_Plugin_VoiceInput" = "การป้อนเสียง";
"Contacts_Plugin_GoogleContact" = "ผู้ติดต่อ Google";
"Contacts_Plugin_LinkedIn" = "LinkedIn";

// Copyright
"copyright" = "ลิขสิทธิ์ © 2011-2017 Tencent สงวนลิขสิทธิ์ทั้งหมด ";
"License_Agreement" = "เงื่อนไขการให้บริการ";
"License_Link" = "http://www.wechat.com/en/service_terms.html";
"About_Version" = "เวอร์ชัน ";

// Settings
"Setting_Title" = "เกม";
"Setting.Section.General" = "ทั่วไป";
"Setting.Section.Stickers" = "สติกเกอร์";
"Setting.Section.Notifications" = "การแจ้งเตือน";
"Setting.Section.Shortcuts" = "ทางลัด";
"Setting.General.LogOut" = "ออกจากระบบ";
"Setting.General.LogOut.Desc" = "การออกจากเครื่อง Mac นี้จะล้างข้อมูลภายในทั้งหมด  คุณจะไม่สามารถเข้าใช้งาน WeChat ได้อีกโดยไม่ต้องล็อกอินอีกครั้ง";
"Setting.General.LogOut.Wipe.Data" = "ออกจากระบบและล้างข้อมูลทั้งหมดบน Mac เครื่องนี้";
"Setting.General.LogOut.Wipe.Data.And.History" = "ออกจากระบบและล้างข้อมูลทั้งหมดบน Mac เครื่องนี้ (รวมประวัติสนทนา)";
"Setting.General.NoWeChatID" = "ไม่ใช่ WeChat ID";
"Setting.General.Save.Chat.History" = "บันทึกประวัติสนทนา";

"Setting_Screen_Capture" = "ภา่พหน้าจอ ";
"Setting_Main_Panel" = "แสดง WeChat: ";
"Setting_Recent_Unread" = "ไปที่ข้อความล่าสุดที่ยังไม่ได้อ่าน ";
"Setting_Send_Message" = "ส่งข้อความ ";
"Setting_Notification" = "การเตือนข้อความ: ";
"Setting_Notification_Sound" = "เล่นเสียง";
"Setting_Notification_Dock" = "Badge dock icon";
"Setting_Notification_Menubar" = "แสดงข้อความที่ยังไม่ได้อ่านบนแถบเมนู";
"Setting_Notification_Preview" = "รวมข้อความตัวอย่าง";
"Setting_File_Received" = "บันทึกไฟล์ที่ได้รับไว้ใน: ";
"Setting_File_Picture" = "บันทึกภาพไปยัง: ";
"Setting_File_Others" = "อื่นๆ…";
"Setting_File_AutoDownload_Category" = "ดาวน์โหลดอัตโนมัติ: ";
"Setting_File_AutoDownload" = "ส่งไฟล์ในการแช็ท";
"Setting_SmallFavoriteFile_AutoDownload" = "ไฟล์ในรายการโปรด (<30 MB)";
"Setting_Restore_Defaults" = "คืนค่าเริ่มต้น";
"Setting_Restore_LogOut" = "ออกจากระบบ";
"Setting_Account" = "บัญชีของฉัน";
"Setting_Download_Menu" = "ดาวน์โหลดเส้นทาง: ";
"Setting_Download_Menu_Other" = "อื่นๆ…";
"Setting_Menubar_Description" = "แสดงในแถบเมนู";
"Setting_Menubar_Always" = "ทุกครั้ง";
"Setting_Menubar_NewMessage" = "ข้อความใหม่";
"Setting_Menubar_Never" = "ไม่เคย";
"Setting_TextSize" = "ขนาดข้อความ";
"Setting_TextSize_ExampleGlyph_Small" = "ตอบ";
"Setting_TextSize_ExampleGlyph_Large" = "ตอบ";
"Setting_LockScreenShotcut" = "ล็อค: ";
"Setting_AccountInformation" = "ข้อมูลบัญชี: ";
"Setting_InformationFeedback" = "ข้อเสนอแนะ: ";
"Setting_SubmitFeedback" = "ส่งข้อเสนอแนะ";
"Setting_MsgRecord" = "ประวัติข้อความ";
"Setting_GoToPreferences" = "ไปที่การกำหนดค่า";
"Setting_MsgNotification" = "การแจ้งเตือน: ";
"Setting_OpenScreenBannerNotification" = "เปิดใช้การแจ้งเตือนแบนเนอร์หน้าจอ: ";
"Setting_OpenScreenBannerNotification_Remark" = "เปิดใช้การแจ้งเตือนแบนเนอร์บนการกำหนดค่า->การแจ้งเตือน";
"Setting_FeedbackStatus_Success" = "ส่งแล้ว";
"Setting_FeedbackStatus_Fail" = "ไม่สามารถส่ง";
"Setting_FeedbackContacts" = "可RTX联系andiezhang和kbchen反馈问题";

// Localizations Used by MASShortcutRecorder framework
// (CHECK THESE!)
"MASShortcut.Cancel" = "ยกเลิก";
"MASShortcut.Delete.Shortcut" = "ลบทางลัด";
"keyboard shortcut" = "ทางลัด";
"OK" = "ตกลง";
"MASShortcut.Record.Shortcut" = "บันทึกทางลัด";
"MASShortcut.Click.To.Record.New.Shortcut" = "คลิกเพื่อตั้งทางลัดใหม่";
"Shortcut cleared" = "ล้างทางลัด";
"Shortcut set" = "ชุดทางลัด";
"Space" = "ที่ว่าง";
"The key combination %@ cannot be used" = "การกดปุ่มร่วมกัน %@ ไม่สามารถใช้ได้";
"This combination cannot be used because it is already used by a system-wide keyboard shortcut.\nIf you really want to use this key combination, most shortcuts can be changed in the Keyboard & Mouse panel in System Preferences." = "คีย์ผสมชุดนี้ไม่สามารถใช้ได้เพราะถูกใช้ไปแล้วโดยแป้นพิมพ์ลัดทั้งระบบ \nถ้าคุณอยากใช้คีย์ผสมนี้ ทางลัดส่วนมากสามารถเปลี่ยนแปลงได้ในแผงแป้นพิมพ์และเมาส์ในการตั้งค่าระบบ";
"This shortcut cannot be used because it is already used by the menu item ‘%@’." = "ทางลัดนี้ไม่สามารถนำมาใช้เพราะถูกใช้แล้วโดยรายการเมนู '%@'";
"To record a new shortcut, click this button, and then type the new shortcut, or press delete to clear an existing shortcut." = "การบันทึกทางลัดใหม่ ให้คลิกที่ปุ่มนี้ แล้วพิมพ์ทางลัดใหม่หรือกดลบเพื่อล้างทางลัดที่มีอยู่";
"MASShortcut.Type.New.Shortcut" = "พิมพ์ทางลัดใหม่";
"MASShortcut.Type.Shortcut" = "พิมพ์ทางลัด";
"MASShortcut.Use.Old.Shortcut" = "ใช้ทางลัดเดิม";


"Setting.StickerStore.StoreTab" = "แกลเลอรี่สติกเกอร์";
"Setting.StickerStore.MyStickersTab" = "สติกเกอร์ของฉัน";
"Setting.StickerStore.DownloadButton" = "ดาวน์โหลด";
"Setting.StickerStore.CantGetStoreError.Title" = "ไม่สามารถเชื่อมต่อกับแกลเลอรี่สติกเกอร์";
"Setting.StickerStore.CantGetStoreError.Description" = "ตรวจสอบการเชื่อมต่อเครือข่ายและลองอีกครั้ง";

// Chat Sidebar Summary Badges
// Shows up when a non-text message gets sent
"Chats.Sidebar.Summary.Image" = "ภาพถ่าย";
"Chats.Sidebar.Summary.Voice" = "เสียง";
"Chats.Sidebar.Summary.Sight" = "SIGHT";
"Chats.Sidebar.Summary.Video" = "วีดีโอ";
"Chats.Sidebar.Summary.File" = "ไฟล์";
"Chats.Sidebar.Summary.Sticker" = "สติกเกอร์";
"Chats.Sidebar.Summary.Namecard" = "รายชื่อ";
"Chats.Sidebar.Summary.Location" = "ตำแหน่งสถานที่";
"Chats.Sidebar.Summary.URL" = "ลิงค์";
"Chats.Sidebar.Summary.Chat.Log" = "สำเนา";
"Chats.Sidebar.Summary.AppMsg" = "แอป";
"Chats.Sidebar.Summary.News" = "ข่าว";
"Chats.Sidebar.Summary.Metion" = "คุณถูกกล่าวถึง: ";

"Chats.Sidebar.DraftPrefix" = "ร่าง: ";
"Chats.Sidebar.MuteGroupChatUnreadPrefix" = "[%d] ";

// Context Menu
"Chats.Menu.Delete" = "ลบ";
"Chats.Menu.Delete.MacHelperMessages" = "เคลียร์";
"Chats.Menu.Sticky" = "ปักหมุดไว้บนสุด";
"Chats.Menu.Unsticky" = "ไม่ปักหมุด";
"Chats.Menu.Mute" = "ปิดเสียง";
"Chats.Menu.Unmute" = "เปิดเสียง";
"Chats.Menu.Rename" = "ตั้งชื่อใหม่";
"Chats.Menu.Leave" = "ออกจากกลุ่ม";
"Chats.Menu.Profile" = "แสดงในผู้ติดต่อ";

// Menu Menu
"Main.Menu.Edit" = "แก้ไข";
"Main.Menu.Copy" = "คัดลอก";
"Main.Menu.Paste" = "วาง";

// Drag overlay
"Chats.SendToDragOverlay.Heading" = "ปล่อยลงที่นี่เพื่อส่งไปที่";
"Chats.SendToDragOverlay.SendToPersonFormat" = "ปล่อยลงที่นี่เพื่อส่งไปที่ %@";
"Chats.SendToDragOverlay.SendToPhone" = "ปล่อยลงที่นี่เพื่อส่งไปที่โทรศัพท์ของคุณ";

// Session Picker
"Session.Picker.Default.Heading" = "เลือกรายชื่อ";
"Session.Picker.Chosen" = "เลือกผู้คน %d คน";
"Session.Picker.Chosen.General" = "เลือกแล้ว";

// New Chat
"Chats.NewChat.Heading" = "สนทนาใหม่";
"Chats.NewChat.ConfirmButton" = "เริ่มสนทนา";
"Chats.NewChat.Recent.Chats" = "การสนทนาล่าสุด";

// Message Type strings (used for notifications and other events)
"Message_type_pic" = "[รูปภาพ]";
"Message_type_draft" = "[ร่าง]";
"Message_type_mention" = "[มีคนกล่าวถึงคุณ]";
"Message_type_voice" = "[เสียง]";
"Message_type_location" = "[ตำแหน่ง]";
"Message_type_sys" = "[ข้อความระบบ]";
"Message_type_unknow" = "[ไม่ทราบ]";
"Message_type_file" = "[ไฟล์]";
"Message_type_card" = "[นามบัตร]";
"Message_type_url" = "[การเชื่อมโยง]";
"Message_type_news" = "[ข่าว]";
"Message_type_appmsg" = "[ข้อความแอป]";
"Message_type_Emoji" = "[สติกเกอร์]";
"Message_type_Video" = "[วิดีโอ]";
"Message_type_Music" = "[เพลง]";
"Message_type_Book" = "[หนังสือ]";
"Message_type_Goods" = "[ผลิตภัณฑ์]";
"Message_type_Short_Video" = "[Sight]";
"Message_type_App_Record" = "[สำเนา]";
"Message_type_Custom_Emoji" = "[สติกเกอร์]";
"Message_type_Note" = "[หมายเหตุ]";
"Message_type_unsupport" = "[ข้อความที่ไม่รู้จัก]";
"Message_type_Voip" = "[วิดีโอคอล]";
"Message_type_Voip_Video" = "เชิญให้คุณใช้วิดีโอคอล";
"Message_type_Voip_Voice" = "เชิญให้คุณใช้วอยซ์คอล";
"MessageContent_Voip"            = "[วอยซ์คอล]";
"MessageContent_VideoVoip"       = "[วิดีโอคอล]";
"MessageContent_VideoVoipRemind" = "[วิดีโอคอล]";
"Voip_Notification_Btn_Accept" = "ยอมรับ";
"Voip_Notification_Btn_Refuse" = "ปฏิเสธ";

"Voip_Notification_Btn_Click_For_Details" = "คลิกเพื่อดูรายละเอียด";

// File Transfer
"File.Transfer.Start.Downloading" = "กำลังดาวน์โหลด…";
"File.Transfer.Uploading" = "กำลังอัปโหลด...";
"File.Transfer.Downloaded" = "ดาวน์โหลดแล้ว";
"File.Transfer.Download.Failed" = "ไม่สามารถาดาวน์โหลด";
"File.Transfer.Download.Cancelled" = "การดาวน์โหลดถูกยกเลิกแล้ว";
"File.Transfer.Uploaded" = "ส่งแล้ว";
"File.Transfer.Upload.Failed" = "ไม่สามารถส่ง";
"File.Transfer.Upload.Cancelled" = "การส่งถูกยกเลิก";
"File.Transfer.Open" = "เปิด";
"File.Transfer.Cancel" = "ยกเลิก";
"File.Transfer.Retry" = "ลองใหม่";
"File.Transfer.Error.TooBig.Header" = "ไฟล์ขนาดเกินกำหนด";
"File.Transfer.Error.TooBig.Body" = "ขออภัย WeChat สามารถส่งไฟล์ได้ถึง %d MB เท่านั้น";
"File.Transfer.Error.Empty.Header" = "ไม่สามารถส่ง";
"File.Transfer.Error.Empty.Body" = "ไม่สามารถส่งได้ เนื่องจากไฟล์มีขนาด 0 KB";
"File.Transfer.Error.Unsupported.Body" = "ไม่สามารถส่งแฟ้มประเภทนี้";
"File.Transfer.FileNotExist.Header" = "ไม่พบไฟล์";
"File.Transfer.Download.FileNotExist.Body" = "ไม่พบไฟล์หรือไฟล์ถูกลบไปแล้ว ดาวน์โหลดอีกหรือไม่";
"File.Transfer.Download.FileExpiredInServer.Body" = "ล้างแฟ้มแล้ว ไม่สามารถดาวน์โหลดได้";
"File.Transfer.Download.FileNotExist.Confirm" = "ดาวน์โหลด";
"File.Transfer.Download.FileNotExist.Cancel" = "ยกเลิก";
"File.Transfer.Download.NotStart" = "ดาวน์โหลดยังไม่เริ่ม";
"File.Transfer.Button.Download" = "ดาวน์โหลด";
"File.Transfer.Forward.FileNotExist.Header" = "ไม่สามารถส่งต่อได้";
"File.Transfer.Forward.FileNotExist.Body" = "ไม่พบไฟล์หรือไฟล์ถูกลบไปแล้ว ไม่สามารถส่งต่อได้";
"File.Transfer.Export.FileNotExist.Header" = "ไม่สามารถส่งออก";
"File.Transfer.Export.FileNotExist.Body" = "ไม่มีไฟล์นี้ หรือถูกลบแล้ว";
"File.Transfer.Export.FileNotDownload.Header" = "ไม่สามารถส่งออก";
"File.Transfer.Export.FileNotDownload.Body" = "ไฟล์นี้ไม่ได้ดาวน์โหลดมาทั้งหมด";
"File.Transfer.Upload.Failed.Group.Chat.Format" = "ไฟล์ใหญ่เกินไป ไม่สามารถส่งไปที่กลุ่มที่มีมากกว่า %lu คนได้";

// Location Message
"LocationMessage.DefaultDescription" = "ตำแหน่งสถานที่";
"LocationMessage.OpenInQQMaps" = "เปิดในแผนที่ Tencent Maps…";
"LocationMessage.OpenInAppleMaps" = "เปิดในแผนที่ Apple Maps…";
"LocationMessage.OpenInGoogleMaps" = "เปิดในแผนที่ Google Maps…";
"LocationMessage.OpenInMaps" = "เปิดในแผนที่…";

// System Message
"BrandContact.ReceiveMessage.Title" = "รับข้อความออฟไลน์";
"BrandContact.ReceiveMessage.Message" = "รับข้อความจากบัญชีทางการนี้";

// Voip Message
"Voip_Connect_Most_Friend" = "ผู้ติดต่อล่าสุด";
"Not_Support_Vediovoip"       = "ขออภัย เครื่องของคุณไม่สนับสนุนวิดีโอคอลล์";
"Not_Support_Vediovoip_Receiver"    = "เพื่อนได้ชวนคุณวิดีโอคอล แต่อุปกรณ์ของคุณไม่สนับสนุนฟังก์ชันนี้";
"Voip_NoNetWork_Tips"          = "เครือข่ายไม่พร้อมใช้งานในตอนนี้ ตรวจสอบเครือข่าย";
"Videovoip_Status_inviting"   = " เชิญให้คุณใช้วิดีโอคอล";
"Videovoip_Status_Calling"    = "กำลังโทร";
"Videovoip_Status_Connecting" = "กำลังเชื่อมต่อ";
"Videovoip_Status_Hangup"     = "วางสายแล้ว";
"Videovoip_Status_Reject"     = "โทรสิ้นสุด: คำขอถูกปฏิเสธ";
"Videovoip_Status_TimeOut"    = "หมดเวลาเชื่อมต่อ";
"Videovoip_Status_BeHanguped" = "การโทรสิ้นสุดโดยผู้ใช้อีกฝ่าย";
"Videovoip_Status_CallFail"   = "การเชื่อมต่อผิดพลาด";
"Videovoip_Status_Exception"  = "โทรสิ้นสุด: เกิดข้อผิดพลาดจากเครือข่าย";
"Videovoip_Status_WaitForAnswer" = "รอการตอบรับ";
"Videovoip_Status_PeerNoAnswer"  = "ไม่รับสายโทร";
"Videovoip_Status_PeerIsBusy"    = "สายไม่ว่าง";
"Videovoip_Status_Caller_CallFail" = "โทรไม่ติด";
"Videovoip_Status_BeRejected"    = "โทรสิ้นสุด: คำขอถูกปฏิเสธ";
"Videovoip_Status_CancelCall"    = "ยกเลิกการโทร";
"Videovoip_Stauts_NotSupport"    = "คุณสมบัตินี้ใช้ได้กับเครือข่าย Wi-Fi เท่านั้น";
"Videovoip_Status_PeerVersion_NotSupport" = "โทรไม่สำเร็จ: ผู้ใช้อีกฝ่ายไม่รองรับวิดีโอคอล";
"Videovoip_Status_CheckContact_Error"     = "ผู้ใช้ไม่ได้เพิ่มคุณในผู้ติดต่อ คุณไม่สามารถเริ่มวิดีโอคอลได้ในตอนนี้";
"Videovoip_Status_Blacklist_Error"        = "เริ่มต้นวิดีโอคอลไม่ได้เนื่องจากคุณถูกผู้ใช้รายอื่นบล็อก";
"Videovoip_Status_PeerPluginClose"        = "โทรสิ้นสุด: เพื่อนของคุณปิดใช้งานวิดีโอคอล";
"Videovoip_Status_NetWorkError" = "โทรสิ้นสุด: เกิดข้อผิดพลาดจากเครือข่าย";
"Videovoip_Status_TalkBroken" = "สิ้นสุดการโทรเนื่องจากสิ้นสุดการเชื่อมต่อ";
"Videovoip_Status_Caller_DetectCamera_Fail" = "ไม่พบกล้อง ลองอีกครั้งในภายหลังหรือสลับเป็นวอยซ์คอลล์";
"Videovoip_Status_Receiver_DetectCamera_Fail" = "ไม่พบกล้อง ลองอีกครั้งในภายหลังหรือสลับเป็นวอยซ์คอลล์";

"Voip_LocalNotification_Tips"   = "%@ เชิญคุณใช้สายวีดีโอ";
"VoiceVoip_LocalNotification_Tips" = "%@ เชิญให้คุณใช้วอยซ์คอล";
"Cancel_LocalNotification_Tips" = "สายที่ไม่ได้รับจาก %@";
"Normal_LocalNotification_Tips" = "คุณได้รับข้อความ WeChat";

"Voicevoip_Status_inviting"   = "เชิญให้คุณใช้วอยซ์คอล";
"Voicevoip_Status_PeerVersion_NotSupport" = "ไม่สามารถโทรได้: ผู้ใช้อีกฝ่ายใช้ WeChat เวอร์ชันที่ไม่รองรับวอยซ์คอล";
"Voicevoip_Status_CheckContact_Error"     = "โทรไม่ได้เพราะผู้ใช้อีกฝ่ายไม่ใช่เพื่อน WeChat ของคุณ";
"Voicevoip_Status_Blacklist_Error"        = "โทรไม่ได้เพราะผู้ใช้อีกฝ่ายปิดกั้นคุณ";
"Voicevoip_Status_PeerPluginClose"        = "ไม่สามารถโทรได้: ผู้ใช้อีกฝ่ายปิดใช้งานคุณสมบัติวอยซ์คอล";
"Voicevoip_Status_BeRejected"    = "ผู้ใช้อีกฝ่ายปฏิเสธคำขอการโทร";

"VoipNetSattus_Bad_Tips" = "สายไม่เสถียร";

"Videovoip_HangupBtnTitle"              = "วางสาย";
"Voice_SpeakerButton" = "ลำโพง";
"Voice_MicButton_Title" = "ปิดเสียง";
"Voice_MicButton_Clicked_Title" = "เปิดไมโครโฟน";

"Voip_NodeView_Status_NotConnected"     = "วางสายแล้ว";
"Voip_NodeView_Status_Call_Complete"    = "ระยะเวลา: %u%u:%u%u";
"Voip_NodeView_Status_Call_Interrupt"   = "ตัดการเชื่อมต่อแล้ว: %u%u:%u%u";
"Voip_NodeView_Status_Cancel" = "ยกเลิกแล้ว";
"Voip_NodeView_Status_Remote_Cancel" = "สายยกเลิกแล้วโดยผู้โทร";
"Voip_NodeView_Status_Busy" = "สายไม่ว่าง";
"Voip_NodeView_Status_Call_Failed" = "โทรไม่ติด";
"Voip_NodeView_Status_No_Answer" = "ไม่รับสาย";
"Voip_NodeView_Status_Remote_No_Answer" = "ไม่รับสายโทร";
"Voip_NodeView_Status_Reject" = "ปฏิเสธแล้ว";
"Voip_NodeView_Status_Remote_Reject" = "สายถูกปฏิเสธโดยผู้ใช้";
"Voip_NodeView_Status_Not_Support" = "ผู้ใช้รับสายไม่ได้";
"Voip_NodeView_Status_Connect_Failed" = "ไม่สามารถเชื่อมต่อได้";
"Voip_NodeView_Status_Ignore" = "ไม่สนใจ";


"Voip_AcceptByVoice"                = "สลับเป็นวอยซ์คอล";
"Voip_SwtichToVoice"                = "สลับเป็นวอยซ์คอล";
"Voip_AcceptCall"                   = "ยอมรับ";
"Voip_RejectCall"                   = "ปฏิเสธ";
"Voip_System_Msg_Content"           = "วิดีโอคอล: %@ %@";
"VoiceVoip_System_Msg_Content"      = "วอยซ์คอล: %@ %@";


"Voip_SendVideoCallInvite"          = "ข้อความ";
"Voip_CallFail_ForTimeLogic_Title"  = "ประกาศ";

"Voip_LocalInviteMsgContent"        = "มาเล่นวิดีโอคอลกัน";
"VoiceVoip_LocalInviteMsgContent"   = "คุณมีเวลาที่จะใช้วอยซ์คอลหรือไม่";

"Voip_Audio_Device_Unplugin_Speaker" = "จะเล่นเสียงผ่านทางลำโพง";
"Voip_Audio_Device_Unplugin_EarPhone" = "เสียงผ่านโทรศัพท์";
"Voip_Audio_Device_Unplugin_Speaker_Alert" = "หูฟังไม่ได้เชื่อมต่อ เสียงจะเปิดเล่นผ่านลำโพงในตอนนี้";
"Voip_Audio_Device_Unplugin_EarPhone_Alert" = "หูฟังไม่ได้เชื่อมต่อ เสียงจะเปิดเล่นผ่านโทรศัพท์ในตอนนี้";
"Voip_RotateScreen"                = "หมุนหน้าจอ";
"Voip_EndCall_Alert_Title"                = "สิ้นสุดการโทร";
"Voip_EndCall_Alert_Message"              = "การปิดหน้าต่างจะสิ้นสุดการโทร";
"Voip_EndCall_Alert_CancelButton_Title"   = "ยกเลิก";
"Voip_EndCall_Alert_ConfirmButton_Title"  = "สิ้นสุดการโทร";
"Voip_Receiver_EndCall_Notification_Msg"  = "โทรสิ้นสุด";

//Voip Status Tips
"Voip_LocalVideoMode_For_Lower_Version" = "กำลังรอการตอบสนองจากผู้รับ";
"Voip_EarModeStatus_Tips"        = "ได้เปลี่ยนไปใช้วอยซ์คอลแล้ว";
"Voip_RemoteVideoModeOpen_Tips"  = "กล้องของผู้ใช้อีกฝ่ายเปิด";
"Voip_RemoteEarMode_Tips" = "กล้องของผู้ใช้อีกฝ่ายปิด";
"Voip_Loudspeaker_Off" = "ได้เปลี่ยนไปใช้วอยซ์คอลแล้ว ถือโทรศัพท์แนบกับหูของคุณ";
"Voip_Loudspeaker_Off_Remote_Switch_To_Voice" = "ผู้ใช้อีกฝ่ายได้เปลี่ยนไปใช้วอยซ์คอลแล้ว";
"Voip_Loudspeaker_Off_No_Mic" = "ได้เปลี่ยนไปใช้วอยซ์คอลแล้ว";
"Voip_Loudspeaker_Off_Remote_Switch_To_Voice_No_Mic" = "ผู้ใช้อีกฝ่ายได้เปลี่ยนไปใช้วอยซ์คอลแล้ว";
"Voip_LocalEarModeTips"     = "กล้องถูกปิดและผู้ใช้อีกฝ่ายไม่เห็นคุณแล้วในตอนนี้";
"Voip_LocalVideoMode"       = "กล้องถูกเปิดและผู้ใช้อีกฝ่ายเห็นคุณแล้วในตอนนี้";

"Voip_LocalBadNetwork" = "ได้เปลี่ยนไปใช้วอยซ์คอลแล้ว เนื่องจากคุณภาพเครือข่ายไม่ดี";
"Voip_RemoteBadNetwork" = "ได้เปลี่ยนไปใช้วอยซ์คอลแล้ว เนื่องจากคุณภาพเครือข่ายของผู้ใช้อีกฝ่ายไม่ดี";

"Voip_LocalBadNetwork_No_Mic" = "ได้เปลี่ยนไปใช้วอยซ์คอลแล้ว เนื่องจากคุณภาพเครือข่ายไม่ดี";
"Voip_RemoteBadNetwork_No_Mic" = "ได้เปลี่ยนไปใช้วอยซ์คอลแล้ว เนื่องจากคุณภาพเครือข่ายของผู้ใช้อีกฝ่ายไม่ดี";

"Voip_CallerView_Hangup" = "ยกเลิก";
"Voip_Contact_Info_View_Button_Title" = "วิดีโอคอล";
"VoiceVoip_Contact_Info_View_Button_Title" = "วอยซ์คอล";
"WeChatCall_Contact_Info_View_Button_Title" = "วิดีโอคอล";

"Voip_RemoteEarMode_before_Answer" = "ผู้ใช้อีกฝ่ายได้เปลี่ยนไปใช้วอยซ์คอลแล้ว";
"Voip_LocalEarMode_before_Answer" = "ได้เปลี่ยนไปใช้วอยซ์คอลแล้ว";
"Voip_Remote_May_Not_Online" = "ผู้ใช้อีกฝ่ายอาจไม่ว่าง ลองอีกครั้งในภายหลัง";


"Voip_VideoView_Minimize_Tips" = "หากย่อขนาด การโทรสายวิดีโอจะดำเนินการต่อโดยเปิดกล้องไว้";
"Voip_VoiceView_Minimize_Tips" = "การย่อขนาดวอยซ์คอลจะเปิดโหมดลำโพง";
"Voip_Video_Conflict" = "โทรสายวีดีโอเปิดใช้อยู่ ลองใหม่ภายหลัง";
"Voip_Audio_Conflict" = "โทรสายเสียงเปิดใช้อยู่ ลองใหม่ภายหลัง";
"Voip_CanStart_Video_Call" = "ไม่สามารถรีสตาร์ทการโทรใหม่หลังจากถูกสร้างมาแล้ว";
"Voip_CanStart_Audio_Call" = "ไม่สามารถรีสตาร์ทการโทรใหม่หลังจากถูกสร้างมาแล้ว";
"Voip_Status_Audio_Working_Tips" =  "กำลังใช้งานวอยซ์คอล แตะเพื่อย้อนกลับ";
"Voip_Camera_Switch_Tips" = "สลับกล้อง";
"Voip_Ignore_Call" = "ไม่รับสาย";
"Voip_Ignore_Alert_Message" = "ผู้โทรจะไม่ได้รับแจ้งว่าถูกยกเลิกสายเมื่อเลือก \"ไม่รับสาย\"";
"Voip_Ignore_End_Message" = "ไม่รับสายเรียกเข้าแล้ว";

"Voip_Video_Minimize_Message" = "ย่อขนาดวิดีโอคอลแล้ว";
"Voip_Audio_Minimize_Message" = "ย่อขนาดวอยซ์คอลแล้ว";
"Voip_Minimize_Button" = "ย่อลง";
"Voip_Interrupt_By_PhoneCall" = "โทรศัพท์กำลังถูกใช้งาน สิ้นสุดวอยซ์คอล";
"Voip_Interrupt_By_OtherApp" = "อุปกรณ์เสียงกำลังถูกใช้งาน สิ้นสุดการโทร";
"Voip_InPhoneCall_Conflict" = "กำลังโทรอยู่ในขณะนี้ ลองอีกครั้งหลังจากโทรเสร็จแล้ว";

// Contacts Sidebar
"Contacts.Sidebar.All" = "รายชื่อทั้งหมด";
"Contacts.Sidebar.Favorites" = "ให้ดาว";
"Contacts.Sidebar.GroupChats" = "บันทึกกลุ่มแล้ว";
"Contacts.Sidebar.Requests" = "ร้องขอ";
"Contacts.Sidebar.OAs" = "บัญชีทางการ";
"Contacts.Sidebar.Enterprise" = "บัญชีองค์กร";
"Contacts.Sidebar.Tags" = "หมายเหตุกำกับ";
"Contacts.Sidebar.Locations" = "ตำแหน่งที่อยู่";
"Contacts.NickNameLabel" = "นามแฝง";
"Contacts.FavoritesHeading" = "★ ติดดาว";

// Contacts Context Menu
"Contacts.Menu.Message" = "ข้อความ";
"Contacts.Menu.Call" = "วิดีโอคอล";
"Contacts.Menu.Share" = "ส่งไปที่การแชท";
"Contacts.Menu.Delete" = "ลบ";

// Contacts List
"Contacts.ContactList.Count.Singular" = "ผู้ติดต่อ %d คน";
"Contacts.ContactList.Count.Plural" = "ผู้ติดต่อ %d คน";

// Emoticon Picker
"EmojiPicker.Category.QQ" = "คลาสสิค";
"EmojiPicker.Category.Human" = "มนุษย์";
"EmojiPicker.Category.Nature" = "ธรรมชาติ";
"EmojiPicker.Category.Objects" = "วัตถุ";
"EmojiPicker.Category.Places" = "สถานที่";
"EmojiPicker.Category.Symbols" = "สัญลักษณ์";

"EmojiPicker.Gesture.SwipeHint" = "เปิดใช้งานท่าทางการเลื่อนเพื่อดูสติกเกอร์อย่างรวดเร็ว";
"EmojiPicker.Gesture.SwipeHintDetail" = "ตั้งท่าทาง \"การปาดระหว่างหน้า\" ในการตั้งค่า";
"EmojiPicker.Gesture.IgnoreHint" = "เพิกเฉย";
"EmojiPicker.Gesture.HandleLater" = "ภายหลัง";
"EmojiPicker.Gesture.HandleRightNow" = "ตั้งตอนนี้";

"Emoticon.Favorite" = "สติกเกอร์ทำเอง";
"EmojiPicker.Adding" = "กำลังโหลด…";
"EmojiPicker.Added" = "เพิ่มแล้ว";
"EmojiPicker.Add.Fail" = "ไม่สามารถเพิ่มได้";
"EmojiPicker.Touch.Limit" = "ถึงจำนวนสติ๊กเกอร์สูงสุดแล้ว";
"EmojiPicker.Add.Timeout" = "หมดเวลาการขอ";

"EmojiPicker.Add.Fail.NeedPurchase" = "สติกเกอร์แบบเสียเงิน ซื้อก่อนเพิ่มรายการ";
"EmojiPicker.Add.Fail.NotValidArea" = "ไม่มีสติ๊กเกอร์ ไม่สามารถเพิ่มได้";
"EmojiPicker.Add.Fail.Expired" = "ไม่สามารถเพิ่มสติกเกอร์นี้ได้ เนื่องจากไม่มีให้ใช้งาน";
"EmojiPicker.Add.Fail.NoSuchProduct" = "ไม่สามารถเพิ่มสติกเกอร์นี้ได้";

// Group Chat Stuff
"CreateChatRoom.MsgFormat" = "คุณได้เชิญ %@ มาที่กลุ่ม";
"CreateChatRoom.MsgSeperate" = ",";
"CreateChatRoom.DefaultTopic"	= "กลุ่ม";
"ChatRoom.ReservedTopicNames"	= "สนทนากลุ่ม";
"ChatRoom.NeedVerify" = "%@ ต้องเป็นเพื่อนของคุณเพื่อที่จะได้รับเชิญเข้ากลุ่มแชท ส่งคำขอเป็นเพื่อนก่อน";
"ChatRoom.Panel_Choose_Contact" = "เลือกผู้ติดต่อ";
"ChatRoom.Panel_Chosen_Num" = "%lu รายชื่อที่เลือก";
"ChatRoom.Panel_Has_Add" = "เลือกแล้ว";
"ChatRoom.Delete_Member_Fail" = "ไม่สามารถลบผู้ติดต่อนี้ได้";
"ChatRoom.Delete_Self" = "คุณไม่สามารถลบตัวเองจากกลุ่ม";

"ChatRoom.ChatRoomBeyondMax" = "คุณได้สร้างจำนวนสมาชิกกลุ่มไว้สูงสุดแล้ว";
"ChatRoom.TopicIllegal" = "ชื่อกลุ่มไม่ถูกต้อง";
"ChatRoom.Unkown_Failed" = "ไม่สามารถสร้างกลุ่ม";
"ChatRoom.ChatRoomMemberBeyondMax" = "กลุ่มนี้เต็มแล้ว ลบสมาชิกออกก่อนที่จะเพิ่มใหม่";
"ChatRoom.ChatRoomMemberNeedUpgrade" = "กลุ่มนี้เต็มแล้ว อัปเกรดขนาดของกลุ่ม";
"ChatRoom.NeedVerifyWait"  = "ส่งคำเชิญเข้าร่วมกลุ่มของคุณแล้ว โปรดรอให้เจ้าของกลุ่มอนุมัติ";
"ChatRoom.NotExist" = "ไม่มีกลุ่มนี้.";
"ChatRoom.Status_Error" = "คุณไม่สามารถเชิญเพื่อนเข้ากลุ่มได้ เนื่องจากเกิดข้อผิดพลาด";
"ChatRoom.Error_NoUser" = "%@ ไม่มีอยู่";
"ChatRoom.Error_BlackList" = "%@ ปฏิเสธที่จะเข้าร่วมกลุ่ม";
"ChatRoom.Error_Verify" = "%@ ไม่ได้เป็นเพื่อน WeChat ของคุณ เพิ่มเข้าเป็นเพื่อนก่อน";

"ChatRoom.Quit.Confirm.Heading" = "ออกจากกลุ่มแช็ท: %@";
"ChatRoom.Quit.Confirm.Message" = "คุณจะไม่ได้รับข้อความจากการแช็ทนี้อีก";
"ChatRoom.Quit.Confirm.OK" = "ออก";

// Sticker Picker
"StickerPicker.CustomStickers" = "กำหนดเอง";

// Compose Bar
"ComposeBar.PlaceholderString" = "ข้อความ";
"ComposeBar.EmoticonTooltip" = "อิโมติคอน";
"ComposeBar.StickerTooltip" = "อิโมติคอน";
"ComposeBar.AttachmentTooltip" = "สิ่งที่แนบมา";
"ComposeBar.VideoTooltip" = "วิดีโอคอล";
"ComposeBar.VoiceTooltip" = "วอยซ์คอล";

"ComposeBar.ScreenshotText" = "ภาพหน้าจอ";
"ComposeBar.Attachment.MaxFileCount.Alert.Desc" = "มีเพียงสิ่งที่แนบ %d แรกเท่านั้นที่สามารถส่งได้";

// Chat Unselected View
"Unselected.Wording" = "ไม่ได้เลือกการสนทนาใด";

// Message Context Menu
"Message.Menu.Copy" = "คัดลอก";
"Message.Menu.Delete" = "ลบ";
"Message.Menu.Forward" = "ส่งต่อ";
"Message.Menu.Add.Emotion" = "เพิ่มสติ๊กเกอร์";
"Message.Menu.Browser" = "เปิดในบราวเซอร์";
"Message.Menu.Copy.Link.Url" = "คัดลอก URL";
"Message.Menu.Refresh" = "รีเฟรช";
"Message.Menu.Service" = "บริการ";
"Message.Menu.Translate" = "แปล";
"Message.Menu.HideTranslation" = "ซ่อนการแปล";
"Message.Menu.Favorites" = "รายการโปรด";
"Message.Menu.Export" = "บันทึกเป็น…";
"Message.Menu.SaveAs" = "บันทึกเป็น…";
"Message.Menu.Recall" = "เรียกคืน";
"Message.Menu.Recall.Over.Two.Mins" = "เรียกคืน";
"Message.Menu.Resend" = "ส่งใหม่";
"Message.Menu.Share.Extension" = "แชร์...";
"Message.Menu.Quote" = "อ้างอิง";
"Message.Menu.Debug.ViewSource" = " ดู XML";
"Message.Menu.Convert.To.Text" = "แปลงเป็นตัวอักษร";
"Message.Menu.Wipe.Out.Text" = "ยุบรายการ";
"Message.Menu.Multiple.Select" = "หลายรายการ";
"Message.ErrorIndicator.Resend" = "ส่งใหม่";

"Message.Notification.Mention" = "%@ กล่าวถึงคุณในกลุ่มแช็ท";

// Message Errors
"Message.Error.Convert.To.Text.Fail" = "การแปลงล้มเหลว";
// Message Multiple select
"Message.Multiple.Select.Forward" = "ส่งต่อทีละครั้ง";
"Message.Multiple.Select.Merge.Forward" = "ร่วมกันและส่งต่อ";
"Message.Multiple.Select.Fav" = "รายการโปรด";
"Message.Multiple.Select.Delete" = "ลบ";
"Contacts.Can.Not.Share.LargeChatRoom.TipsFormat" = "ไฟล์ใหญ่เกินไป ไม่สามารถส่งไปที่กลุ่มที่มีมากกว่า %lu คนได้";

"Message.Multiple.Select.Undownload" = "ไม่สามารถส่งต่อและทำให้สติ๊กเกอร์ที่ยังไม่ได้ดาวน์โหลด รูปภาพ วิดีโอ และไฟล์จากรายการที่เลือกเป็นรายการโปรดได้";
"Message.Multiple.Select.NotAllowForword" = "ไม่สามารถส่งต่อเสียง นามบัตร เกม บัตรและข้อเสนอ ข้อความการชำระเงินจากรายการที่เลือกได้";
"Message.Multiple.Select.NotAllowFav" = "ไม่สามารถชื่นชอบสติ๊กเกอร์ นามบัตร เกม บัตรและข้อเสนอ เร็กคอร์ด เคล็ดลับการชำระเงิน หรือข้อความพิเศษอื่น ๆ จากรายการที่เลือกได้";
"Message.Multiple.Select.Undownload.NotAllowForward" = "ไม่สามารถส่งต่อเสียง นามบัตร เกม บัตรและคูปอง เร็กคอร์ด เคล็ดลับการชำระเงิน หรือสติ๊กเกอร์ที่ยังไม่ได้ดาวน์โกหลด รูปภาพ วิดีโอ และไฟล์จากรายการที่เลือกเป็นรายการโปรดได้";
"Message.Multiple.Select.Undownload.NotAllowFav" = "ไม่สามารถทำให้สติ๊กเกอร์ นามบัตร เกม บัตรและคูปอง เร็กคอร์ด เคล็ดลับการชำระเงิน หรือสติ๊กเกอร์ที่ยังไม่ได้ดาวน์โกหลด รูปภาพ วิดีโอ และไฟล์จากรายการที่เลือกเป็นรายการโปรดได้";
"Message.Multiple.Select.NotAllow.MergeForward" = "ไม่สามารถรวมและส่งต่อสคริปต์การสนทนา บันทึก ไฟล์ขนาดใหญ่ เสียง นามบัตร เกม บัตรและคูปอง และเคล็ดลับการชำระเงินจากรายการที่เลือกได้";

"Fav_Node_Name_Record" = "[สำเนา]";
"Fav_Node_Name_Card" = "[ข้อความบัตรและข้อเสนอ]";
"Fav_Node_Name_Emoji" = "[สติกเกอร์]";
"Fav_Node_Name_Pay" = "[ข้อความการชำระเงิน]";
"Fav_Node_Name_Not_Support" = "[ไม่สามารถแสดงข้อความนี้ได้]";
"Fav_Node_Name_ShareCard" = "[นามบัตร]";
"Fav_Record_Title" = "สำเนา";

// Message Delete
"Message.Delete.Confirm.Title" = "ลบข้อความ";
"Message.Delete.Confirm.Description" = "ลบข้อความนี้หรือไม่";
"Message.Delete.Multiple.Confirm.Description" = "ลบข้อความที่เลือกหรือไม่";
"Message.Delete.Confirm.Action" = "ลบ";

// Forward Message Sheet
"Message.ForwardSheet.Header" = "ส่งต่อข้อความ";
"Message.ForwardSheet.Confirm" = "ส่งต่อ";
"Message.ForwardSheet.ErrorHeader" = "ไม่สามารถส่งต่อข้อความ";
"Message.ForwardSheet.ErrorDescription" = "เกิดข้อผิดพลาดในการส่งต่อข้อความ";
"Message.ForwardAlert.Header" = "ส่งต่อข้อความ";
"Message.ForwardAlert.Description" = "ส่งต่อข้อความไปยังการแชทในปัจจุบันหรือไม่";

// Video Message Sheet
"Message.Video.ErrorHeader.Forward" = "ไม่สามารถส่งต่อได้";
"Message.Video.ErrorHeader.Copy" = "ไม่สามารถคัดลอกวิดีโอ";
"Message.Video.ErrorDescription.ShouldDownload" = "ดาวน์โหลดวิดีโอก่อน";
"Message.Video.ErrorDescription.General" = "ไม่สามารถส่งต่อข้อความ";
"Message.Video.Compressing" = "กำลังบีบอัด…";

// Friend Request
"Friend.Request.Default.Content" = " อยากเพิ่มคุณเป็นเพื่อน";
"Friend.Request.Accept" = "ยอมรับ";
"Friend.Request.Delete" = "ลบ";
"Friend.Request.Added" = "เพิ่มแล้ว";
"Friend.Request.View.Title" = "คำขอเป็นเพื่อน";
"Friend.Request.Accept.ErrorHeader" = "ไม่สามารถเพิ่มเพื่อน";

"Friend.Request.WaitingForConfirm" = "ส่งคำขอแล้ว";
"Friend.Request.Greeting" = "ส่งข้อความ";


// Friend Verify
"Friend.Verify.Message.Window.Title" = "การรับรองเพื่อน";
"Friend.Verify.Message.Window.Hint" = "ส่งคำขอเป็นเพื่อนไปยัง %@";
"Friend.Verify.Message.Window.Send" = "ส่ง";
"Friend.Verify.Message.Window.Default.Message" = "ฉันคือ %@";
"Friend.Verify.Message.Window.Default.Message.Group.Chat" = "สวัสดี เราชื่อ \"%2$@\" จาก %1$@";


// Send Friend Request Dialog
"SendFriendRequest.Heading" = "ส่งคำขอเป็นเพื่อน";
"SendFriendRequest.Prompt" = "ป้อนข้อความทักมาย:";
"SendFriendRequest.DefaultMsgFormat" = "ฉันคือ %@";
"SendFriendRequest.Send" = "ส่ง";


// Unsupported Message
"Message.Unsupported" = "ข้อความที่ไม่สนับสนุน ดูบนโทรศัพท์";

// Hongbao Message
"Message.Hongbao.Summary" = "[อั่งเปา]";
"Message.Hongbao.Send.Hint" = "[คุณส่งอั่งเปาแล้ว]";
"Message.Hongbao.Receive.Hint" = "[คุณได้รับอั่งเปาแล้ว ดูบนโทรศัพท์]";
// Transfer Message
"Message.Transfer.Send.Summary" = "[การโอนเงิน] รอให้เพื่อนรับเงิน";
"Message.Transfer.Send.Hint" = "[คุณโอนเงินแล้ว]";
"Message.Transfer.Send.Accept.Summary" = "[การโอนเงิน] คุณยืนยันการรับแล้ว";
"Message.Transfer.Send.Accept.Hint" = "[คุณได้รับการโอนเงินแล้ว]";
"Message.Transfer.Send.Reject.Summary" = "[การโอนเงิน] คุณคืนเงินจากการโอนเงินแล้ว";
"Message.Transfer.Send.Reject.Hint" = "[คุณคืนเงินจากการโอนเงินแล้ว]";
"Message.Transfer.Receive.Summary" = "[การโอนเงิน] ยืนยันการรับ";
"Message.Transfer.Receive.Hint" = "[คุณรับการโอนเงินแล้ว ดูบนโทรศัพท์]";
"Message.Transfer.Receive.Accept.Summary" = "[การโอนเงิน] เพื่อนได้รับแล้ว";
"Message.Transfer.Receive.Accept.Hint" = "[เพื่อนได้รับแล้ว]";
"Message.Transfer.Receive.Reject.Summary" = "[การโอนเงิน] เพื่อนคืนเงินแล้ว";
"Message.Transfer.Receive.Reject.Hint" = "[เพื่อนคืนเงินแล้ว]";

// Export
"Link.Export.Default.Title" = "กำลังเชื่อมโยง";

// Debug Tools
"DebugTools.FeatureNotReady.Header" = "เร็วๆ นี้";
"DebugTools.FeatureNotReady.Body" = "คุณสมบัตินี้ยังใช้งานไม่ได้";
"DebugTools.Menu.CheckForUpdates" = "ตรวจสอบอัปเดต...";
"DebugTools.Menu.CheckForUpdates.DisabledDueToNetwork" = "ตรวจสอบอัปเดต… (ต้องมี OfficeWifi)";
"DebugTools.Menu.ReadReleaseNotes" = "บล็อกแจ้งกำหนรดการวางตลาด";
"DebugTools.Menu.UploadLogs" = "อัปโหลดแฟ้มบันทึก…";
"DebugTools.Menu.Filesystem" = "ไฟล์ระบบ";
"DebugTools.Menu.Filesystem.Library" = "เปิด ไลบราลี (สำหรับบัญชีนี้)";
"DebugTools.Menu.Filesystem.Cache" = "เปิด แคช (สำหรับบัญชีนี้)";
"DebugTools.Menu.MarkAllAsRead" = "ทำเครื่องหมายว่าอ่านแล้วทั้งหมด";
"DebugTools.Menu.KitchenSink" = "อ่างล้างจาน";
"DebugTools.Menu.SwitchServer" = "สลับเสิร์ฟเวอร์";


// Log Report
"LogReport.Description" = "คลิกด้านล่างเพื่ออัปโหลดบันทึกของคุณเพื่อช่วยเราแก้ปัญหาของคุณ";
"LogReport.Upload" = "อัปโหลดบันทึก";
"LogReport.Uploading" = "กำลังอัปโหลด...";
"LogReport.UploadFinished" = "อัปโหลดเสร็จแล้ว ขอบคุณที่ช่วยเหลือ!";
"LogReport.UploadFailed" = "ไม่สามารถอัพโหลดบันทึก ตรวจสอบเครือข่ายและลองอีกครั้ง";
"LogReport.UploadDone" = "เสร็จสิ้น";

// Search
"Search.Comma" = ", ";
"Search.Include" = "รวม %@";
"Search.GroupName" = "ชื่อกลุ่ม: ";
"Search.Nickname" = "นามแฝง: ";
"Search.Username" = "ไอดี WeChat: %@";
"Search.Remark" = "หมายเหตุ: ";
"Search.RemarkDescription" = "หมายเหตุ: ";
"Search.City" = "เมือง: ";
"Search.Province" = "จังหวัด: ";
"Search.Country" = "ประเทศ: ";
"Search.NoResults" = "ไม่มีผลลัพธ์";
"Search.Section.Contact" = "ผู้สส่ง";
"Search.Section.GroupChat" = "สนทนากลุ่ม";
"Search.Section.OA" = "บัญชีทางการ";
"Search.Section.Favorite" = "รายการโปรด";
"Search.Section.See.All.Format" = "ดูทั้งหมด (%d)";
"Search.Section.Fold" = "พับ";

//==== Favorites ====
"Favorites.Default.Title.Text" = "ข้อความ";
"Favorites.Default.Title.Video" = "วิดีโอ";
"Favorites.Default.Title.Sight" = "Sight";
"Favorites.Default.Title.Image" = "รูปถ่าย";
"Favorites.Default.Title.Voice" = "เสียง";
"Favorites.Default.Title.WebPage" = "กำลังเชื่อมโยง";
"Favorites.Default.Title.Location" = "ตำแหน่งสถานที่";
"Favorites.Default.Title.Music" = "เพลง";
"Favorites.Default.Title.File" = "ไฟล์";
"Favorites.Default.Title.Book" = "จอง";
"Favorites.Default.Title.Product" = "ผลิตภัณฑ์";
"Favorites.Default.Title.TV" = "ทีวี";
"Favorites.Default.Title.Card" = "การ์ด";
"Favorites.Default.Title.Record" = "ทรานสคริปต์";
"Favorites.Default.Title.Record.Format" = "สำเนาสำหรับ %@";
"Favorites.File.Over.Limit.Title" = "ไฟล์โปรด";
"Favorites.File.Over.Limit.Description" = "ไฟล์ขนาดใหญ่เกินไป ไม่สามารถทำเป็นไฟล์โปรดได้";
"Favorites.No.FavItems.Description" = "ไม่มีรายการโปรด";
"Favorites.No.FavItems.Add.Items.Tips" = "คุณสามารถเพิ่มสคริปต์สนทนาไปที่รายการโปรดได้";

// Forward Favorite Sheet
"Favorite.ForwardSheet.Header" = "ส่งรายการโปรด";
"Favorite.ForwardSheet.Confirm" = "ส่ง";
"Favorite.ForwardSheet.ErrorHeader" = "ไม่สามารถส่งต่อข้อความ";
"Favorite.ForwardSheet.ErrorDescription" = "ระบบไม่ว่าง ลองอีกครั้งในภายหลัง";
"Favorite.ForwardAlert.Header" = "ส่ง";
"Favorite.ForwardAlert.Description" = "คุณแน่ใจหรือไม่ว่าต้องการส่งการสนทนานี้";

"Favorites.AddToFavoritesDragOverlay" = "เพิ่มลงในรายการโปรด";
"Favorites.Via" = "จาก: ";
"Favorites.GroupChat.Default.Name" = "สนทนากลุ่ม";
"Favorites.Show.In.Fav" = "ดูในรายการโปรด";
"Favorites.Usage.Format" = "ใช้แล้ว %@ มี %@";

// Favorites Context Menu
"Favorites.Menu.Send.To.Friend" = "ส่งไปที่การแชท";
"Favorites.Menu.Copy" = "คัดลอก";
"Favorites.Menu.Delete" = "ลบ";
"Favorites.Menu.Download" = "ดาวน์โหลด";
"Favorites.Menu.Open.File" = "เปิด";
"Favorites.Menu.Export.File" = "บันทึกเป็น…";
"Favorites.Confirm.Delete.Title" = "ลบจากรายการโปรดหรือไม่";
"Favorites.Confirm.Delete.Title.Multiple" = "ลบ %lu รายการจากรายการโปรดหรือไม่";
"Favorites.Confirm.Delete.Desc" = "ถ้าคุณลบมันจะหายไปจากบัญชีของคุณบนทุกๆ อุปกรณ์";
"Favorites.Confirm.Delete.Desc.Multiple" = "ถ้าคุณลบรายการเหล่านี้ มันจะหายไปจากบัญชีของคุณบนทุกๆ อุปกรณ์";
"Favorites.Confirm.Delete" = "ลบ";
"Favorites.Menu.View.Debug.XML" = " ดู XML";

"Favorites.Send.Heading.Singular" = "ส่งรายการโปรด";
"Favorites.Send.Heading.Plural" = "ส่ง %d รายการโปรด";
"Favorites.Send.Button" = "ส่ง";
// Error
"Favorites.Send.Error.Header" = "ไม่สามารถส่ง";
"Favorites.Send.Error.SingleItem.Body" = "รายการนี้ไม่สามารถส่งต่อได้ จนกว่าจะเสร็จสิ้นการดาวน์โหลด";
"Favorites.Send.Error.MultiItems.Body" = "รายการเหล่านี้ไม่สามารถส่งต่อได้ จนกว่าจะเสร็จสิ้นการดาวน์โหลด";
"Favorites.Send.Error.MultiItems.WithNames.Body" = "ยังไม่ได้ดาวน์โหลดรายการ: %@ เมื่อเสร็จแล้ว คุณจะสามารถส่งต่อพวกมันได้";
"Favorites.Send.Error.SingleItem.Waitting.Download.Body" = "กำลังดาวน์โหลดรายการโปรด ลองอีกครั้งในภายหลัง";
"Favorites.File.Export.Error.Header" = "ไม่สามารถส่งออกไฟล์";
"Favorites.Open.Error.Header" = "ไม่สามารถเปิด";
"Favorites.Open.Error.SingleItem.Waitting.Download.Body" = "กำลังดาวน์โหลดรายการโปรด เปิดอีกครั้งในภายหลัง";
"Favorites.File.Export.Error.Body" = "ดาวน์โหลดไฟล์ก่อน";
"OA.Number.Over.Limit.Addcontact.Fail" = "ไม่สามารถติดตามได้";
"OA.Number.Over.Limit" = "ถึงขีดจำกัดการติดตามบัญชีทางการแล้ว";
"Favorites.Record.Group.Forward.Title" = "สำเนาสำหรับ %@";


// Favorites sidebar
"Favorites.Sidebar.All" = "รายการทั้งหมด";
"Favorites.Sidebar.PhotoItems" = "รูปถ่าย";
"Favorites.Sidebar.URLItems" = "กำลังเชื่อมโยง";
"Favorites.Sidebar.MusicItems" = "เพลง";
"Favorites.Sidebar.NoteItems" = "แจ้งเตือน";
"Favorites.Sidebar.Tag" = "แท็ก";
"Favorites.Sidebar.Senders" = "รายชื่อ";
"Favorites.Sidebar.Chats" = "กลุ่ม";
"Favorites.Sidebar.FileItems" = "ไฟล์";
"Favorites.Sidebar.ShowMore" = "ดูทั้งหมด";
"Favorites.Sidebar.Hide" = "ซ่อน";


// Favorites Viewer Window
"Favorites.Viewer.Title.Template" = "%1$@ จาก %2$@"; // See http://stackoverflow.com/questions/1063843/is-there-a-way-to-specify-argument-position-index-in-nsstring-stringwithformat
"Favorites.Viewer.Action.Forward" = "ส่งต่อ";
"Favorites.Viewer.Action.Delete" = "ลบ";
"Favorites.Viewer.Action.Export" = "บันทึกเป็น…";
"Favorites.Viewer.Action.SaveAs" = "บันทึกเป็น…";
"Favorites.Viewer.Action.OpenInBrowser" = "เปิดในบราวเซอร์";
"Favorites.Viewer.Action.AddToFavorites" = "เพิ่มลงในรายการโปรด";
"Favorites.Viewer.Action.Share" = "แชร์";
"Favorites.Viewer.Action.Forwar.Failed.Title" = "ส่งต่อผิดพลาด";
"Favorites.Viewer.Action.Forwar.Failed.Message" = "ไม่สามารถส่งออกรายการนี้ได้ เนื่องจากยังดาวน์โหลดไม่เสร็จ";
"Favorites.Viewer.Action.Previous.Item" = "ก่อนหน้า";
"Favorites.Viewer.Action.Next.Item" = "ถัดไป";
"Favorites.Viewer.Action.OpenWith" = "เปิดด้วยแอปเริ่มต้น";
"Favorites.Viewer.Action.OpenWith.CustomApp" = "เปิดด้วย \"%@\"";
"Favorites_Video_Time_Min" = "%02lu:%02lu";
"Favorites_Video_Time_Sec" = "00:%02lu";

"Favorites.Note.UnKnowType" = "ไม่สามารถดูเนื้อหานี้ในเวอร์ชันปัจจุบันได้";
"Favorites.Note.UpdateTips" = "อัพเดตเป็น WeChat เวอร์ชันล่าสุด";
"Favorites.Note.Downloading" = "กำลังโหลด…";

"Fav.Record.Single.Forward.Title" = "ประวัติสนทนาสำหรับ %@ และ %@";
"Fav.Record.Group.Forward.Title.New" = "%@, %@ และ %@";
"Fav.Record.Group.Forward.Title" = "สำเนาสำหรับ %@";
"Contacts.GroupCard"			= "กลุ่ม";
"Fav_Record_SubItem_Time" = "%d-%d-%d %@"; //2014-2-18 下午5:08
"Fav_Record_Group_Forward_Title_New" = "%@, %@ และ %@";
"Fav_Record_Group_Forward_Title_Count" = "%u คน";
"Fav_Record_Forward_Voice_CannotPlay" = "เสียงที่ส่งต่อไม่สามารถเล่นได้";

"Fav_Node_Img_Title" = "[รูปภาพ]";
"Fav_Node_Location_Title" = "[ตำแหน่ง] %@";
"Fav_Node_Voice_Title" = "[เสียง]";
"Fav_Node_Emoji_Title" = "[สติกเกอร์]";
"Fav_Node_Video_Title" = "[วิดีโอ]";
"Fav_Node_File_Title" = "[ไฟล์] %@";
"Fav_Node_Music_Title" = "[เพลง] %@";
"Fav_Node_Goods_Title" = "[สินค้า] %@";
"Fav_Node_TV_Title" = "[ทีวี] %@";
"Fav_Node_URL_Title" = "[URL] %@";
"Fav_Node_Sight_Title" = "[Sight]";

//WeNote
"WeNote_Default_Title" = "เพิ่มชื่อ";
"WeNote_Update_Time" = "แก้ไขครั้งล่าสุดเมื่อ ";
"WeNote_Recording" = "กำลังบันทึก";
"WeNote_Downloading" = "กำลังโหลด…";
"WeNote_UnknownType" = "ไม่สามารถดูเนื้อหานี้ในเวอร์ชันปัจจุบันได้";
"WeNote_UpdateTips" = "อัพเดตเป็น WeChat เวอร์ชันล่าสุด";
"WeNote_Conflict_Prefix" = "แก้ไขความไม่สอดคล้องกัน";
"WeNote_Conflict" = "แก้ไขความไม่สอดคล้องกัน (%lu-%lu-%lu)";
"OpenApi_MainItem_Note" = "[หมายเหตุ]";
"WeNote_Message_Default_Title" = "แจ้งเตือน";
"WeNote_Fav_Icon_Text" = "รายการโปรด";
"WeNote_Total_Image_Count" = "%lu ภาพ";

// Date
"Favorites.Date.Today" = "วันนี้";
"Favorites.Date.This.Week" = "สัปดาห์นี้";

// Search
"Favorites.Search.Section.Header.Content" = "เนื้อหา";
"Favorites.Search.Section.Header.Sender" = "ผู้สส่ง";
"Favorites.Search.Section.Header.GroupChat" = "สนทนากลุ่ม";
"Favorites.Search.Result.Number.Singular" = "(1 ผลลัพธ์)";
"Favorites.Search.Result.Number.Multiple" = "(%d ผลลัพท์)";
// SenderInfo
"Favorites.SenderInfo.NickName.Prefix" = "จาก: ";

//收藏容量
"Fav_Capacity_Title" = "ล้างพื้นที่เก็บข้อมูลรายการโปรด";
"Fav_Capacity_Alert_NotEnough_Title" = "ที่จัดเก็บไม่พอ";
"Fav_Capacity_Alert_NotEnough_Content" = "ไม่สามารถใช้รายการโปรดได้ เพิ่มพื้นที่ว่างแล้วลองอีกครั้ง";
"Fav_Capacity_Detail" = "รายละเอียด";
"Fav_Capacity_Nearly_UsedUp" = "พื้นที่เก็บข้อมูลไม่เพียงพอ เพิ่มพื้นที่ว่างแล้วลองอีกครั้ง";
"Fav_Capacity_Already_UsedUp" = "ไม่สามารถอัปโหลดเนื้อหาได้ เนื่องจากพื้นที่เก็บข้อมูลไม่เพียงพอ เพิ่มพื้นที่ว่างและลองอีกครั้ง";
"Fav_Capacity_Left" = "ที่มี: ";
"Fav_Capacity_Choosen" = "เรียกคืน: ";
"Fav_Capacity_Delete_Tip" = "ไม่สามารถกู้คืนรายการที่เลือกไว้ได้เมื่อลบแล้ว ลบเลยหรือไม่";

// Message Unread Tips
"Message.Unread.TipsSingular" = "1 ข้อความใหม่";
"Message.Unread.TipsPlural" = "%d ข้อความใหม่";
"Message.Unread.DividerText" = "ด้านล่างคือข้อความใหม่";

// Official Account
"OA_Read_More" = "อ่านเพิ่มเติม";

// Time
"Util_Today" = "วันนี้";
"Util_Yesterday" = "เมื่อวาน";
"Util_Sunday" = "วันอาทิตย์";
"Util_Monday" = "วันจันทร์";
"Util_Tueday" = "วันอังคาร";
"Util_Wedday" = "วันพุธ";
"Util_Thuday" = "วันพฤหัสบดี";
"Util_Friday" = "วันศุกร์";
"Util_Satday" = "วันเสาร์";
"Util_Daybreak"  = "ตอนเช้า";
"Util_Morning"   = "ตอนเช้า";
"Util_Noon"      = "ตอนบ่าย";
"Util_Afternoon" = "เที่ยง";
"Util_Evening"   = "กลางคืน";

// Name Card
"Message.Name.Heading" = "นามบัตร";
"Message.Name.Heading.Official.Account" = "บัญชีทางการ";
"Message.Name.GroupChatInviteHeading" = " เชิญคุณเข้าร่วมกลุ่ม";
"Message.Name.Card.Added" = "เพิ่มแล้ว";
"Message.Name.Card.NotFriendYet" = "ยังไม่มีเพื่อนเลย";
"Message.Name.Card.AddButton" = "เพิ่ม";
"Message.Name.Card.MessageButton" = "ข้อความ";
"Message.Name.Card.OpenGroupButton" = "ข้อความ";
"Message.Name.Card.JoinGroupButton" = "เข้าร่วมกลุ่ม";
"Message.Name.Card.GroupAlreadyJoined" = "เป็นสมาชิกแล้ว";
"Message.Name.Card.GroupNotYetJoined" = "ยังไม่ได้เป็นสมาชิก";

"Message.Reader.ReadMore" = "อ่านเพิ่มเติม";
"Message.Recall.Failed" = "ไม่สามารถเรียกคืนข้อความ ตรวจสอบเครือข่ายของคุณ";
"Message.Recall.Succ" = "คุณได้เรียกคืนข้อความแล้ว";

"Message.Translate.Failed.Heading" = "ไม่สามารถแปลได้";
"Message.Translate.Failed.Default" = "ลองอีกครั้งภายหลัง";
"Message.Translate.Failed.Text.Over.Limit" = "ข้อความนี้ยาวเกินไป และไม่สามารถแปลได้";
"Message.Translate.Finish" = "แปลแล้ว";

"Message.Input.Too.Long.Title" = "ข้อความยาวเกินไป";
"Message.Input.Too.Long.Content" = "ข้อความยาวเกินไปที่จะส่ง";

"Message.Draft.Photo" = "[รูปภาพ]";

// Chat Inspector
"ChatInspector.Sticky" = "ปักหมุดไว้บนสุด";
"ChatInspector.Favorite" = "ให้ดาว";
"ChatInspector.Mute" = "ปิดเสียง";
"ChatInspector.Share" = "แชร์";
"ChatInspector.LeaveChat" = "ออก";
"ChatInspector.ShowNames" = "ชื่อบนหน้าจอ";
"ChatInspector.Send.Message" = "ข้อความ";
"ChatInspector.Add.Contact" = "เพิ่มรายชื่อ";

"ChatInspector.ActionMenu.Invite" = "เชิญผู้คน…";
"ChatInspector.ActionMenu.GroupQRCode" = "QR โค้ดของกลุ่ม";

"ChatInspector.AddMembers.Title" = "เพิ่มไปที่การแช็ท";
"ChatInspector.AddMembers.Confirm" = "เพิ่ม";
"ChatInspector.AddMembers.Back" = "แชท";

"ChatInspector.InviteMembers.Title" = "เชิญร่วมการแช็ท";
"ChatInspector.InviteMembers.Confirm" = "ส่ง";
"ChatInspector.InviteMembers.Back" = "ย้อนกลับ";

"ChatInspector.ShareIndNamecard.Title" = "แชร์นามบัตรที่ติดต่อของ %@";
"ChatInspector.ShareIndNamecard.Confirm" = "ส่ง";
"ChatInspector.ShareIndNamecard.Back" = "ย้อนกลับ";

"ChatInspector.QRCode.Heading" = "QR โค้ดของกลุ่ม";
"ChatInspector.QRCode.Title" = "แชร์ฺ QR โค้ดของกลุ่ม";
"ChatInspector.QRCode.Description" = "ลากและวางบนใบปลิว อีเมล หรือที่ที่คนจะมองเห็น!";
"ChatInspector.QRCode.SaveButton" = "บันทึก";
"ChatInspector.QRCode.RevokeButton" = "ถอน";

// Group Chat Inspector
"GroupChatInspector.UpdateChatName" = "ตั้งชื่อใหม่";
"GroupChatInspector.UpdateNickName" = "เปลี่ยนนามแฝงของกลุ่ม";

// Chat Info Panel
"ChatInfoPanel.Add.Member" = "เพิ่มสมาชิก";
"ChatInfoPanel.Remove.Member" = "ลบสมาชิก";
"ChatInfoPanel.LeaveChat" = "ออก";
"ChatInfoPanel.Loading" = "กำลังโหลด…";
"ChatInfoPanel.Removed" = "ลบแล้ว";
"ChatInfoPanel.Added" = "เพิ่มแล้ว";
"ChatInfoPanel.Failed" = "ระบบไม่ว่าง ลองอีกครั้งในภายหลัง";
"ChatInspector.Save.To.Address.Book" = "บันทึกลงในผู้ติดต่อ";
"ChatInfoPanel.Add.Member.Confirm" = "เพิ่ม";
"ChatInfoPanel.Remove.Member.Confirm" = "ลบ";

//Chat Detail Panel
"ChatDetailPanel.GroupChatName" = "ชื่อกลุ่ม";
"ChatDetailPanel.GroupChatNamePlaceHolder" = "แตะเพื่อแก้ไขการเตือนกลุ่ม";
"ChatDetailPanel.GroupChatAnnounce" = "ประกาศของกลุ่ม";
"ChatDetailPanel.GroupChatAnnounce.NotOwnerPlaceHolder" = "ยังไม่มีการเตือนกลุ่ม";
"ChatDetailPanel.GroupChatAnnounce.OwnerPlaceHolder" = "แตะเพื่อตั้งการเตือนกลุ่ม";
"ChatDetailPanel.GroupChat.AddMember" = "เพิ่มสมาชิก";
"ChatDetailPanel.GroupChat.RemoveMember" = "ลบสมาชิก";
"ChatDetailPanel.LeaveGroupChat" = "ออก";
"ChatDetailPanel.Announcenment.Cancel" = "ยกเลิก";
"ChatDetailPanel.Announcenment.Confirm" = "เผยแพร่";
"ChatDetailPanel.Loading" = "กำลังโหลด…";
"ChatDetailPanel.Removed" = "ลบแล้ว";
"ChatDetailPanel.Removed.Fail" = "ไม่สามารถลบ";
"ChatDetailPanel.Added" = "เพิ่มแล้ว";
"ChatDetailPanel.Failed" = "ระบบไม่ว่าง ลองอีกครั้งในภายหลัง";
"ChatDetailPanel.Announcement.AtAll" = "@ทั้งหมด";
"ChatDetailPanel.NoAnnouncement.Hint" = "ไม่มีเนื้อหา";
"ChatDetailPanel.NoAnnouncement.Description" = "เฉพาะเจ้าของเท่านั้นที่สามารถแก้ไขประกาศของกลุ่ม";
"ChatDetailPanel.Announcement.SaveFail" = "บันทึกการเตือนกลุ่ม";

// Contact Inspector:
"Contacts.Inspector.LocationKeyLabel" = "ภูมิภาค";
"Contacts.Inspector.SourceKeyLabel" = "จาก ";
"Contacts.Inspector.NickNameLabel" = "นามแฝง";
"Contacts.Inspector.RemarkValueLabelPlaceHolder" = "ตั้ง Remark";
"Contacts.Inspector.ToolTips.SendMessage" = "ข้อความ";
"Contacts.Inspector.ToolTips.ShareNameCard" = "แชร์นามบัตร";
"Contacts.Inspector.ToolTips.AddToContact" = "เพิ่ม";
"Contacts.Inspector.ToolTips.ViewHistoryMessage" = "ดูประวัติข้อความ";
"Contacts.Inspector.ToolTips.AddBizContact" = "ติดตาม";

"Contacts.UserNameKeyLabel" = "WeChat ID";
"Contacts.LocationKeyLabel" = "ตำแหน่งสถานที่";
"Contacts.DescriptionKeyLabel" = "ข้อสังเกต";
"Contacts.StatusKeyLabel" = "สถานะ";
"Contacts.BrandIntroKeyLabel" = "แนะนำ";
"Contacts.SourceKeyLabel" = "แหล่งที่มา";
"Contacts.GroupChatNameLabel" = "ชื่อกลุ่ม";
"Contacts.TagKeyLabel" = "หมายเหตุกำกับ";
"Contacts.RemarkKeyLabel" = "ข้อสังเกต";
"Contacts.Header.Profile" = "โปรไฟล์";
"Contacts.Header.MyNotes" = "บันทึกของฉัน";
"Contacts.Header.Favorites" = "รายการโปรด";
"Contacts.Value.NoneSet" = "ไม่ได้ตั้ง";
"Contacts.EnterChat" = "ข้อความ";
"Contacts.GroupChat.SendMsg" = "เข้ากลุ่ม";
"Contacts.GroupChat.Remove" = "ลบจากผู้ติดต่อ";
"Contacts.SendMsgToBrankContact" = "ดูประวัติข้อความ";

"Contacts.CardInspector.Action.Message" = "ข้อความ";
"Contacts.CardInspector.Action.Favorite" = "ให้ดาว";
"Contacts.CardInspector.Action.ShareNamecard" = "แชร์นามบัตรที่ติดต่อ";
"Contacts.CardInspector.Action.Delete" = "กำลังลบ...";
"Contacts.SourceList.Tag.Delete" = "ลบ";
"Contacts.SourceList.Tag.Rename" = "ตั้งชื่อใหม่";

"Contacts.Delete.Title.Format" = "ลบ %lu รายชื่อหรือไม่";
"Contacts.Delete.Description" = "หากทำต่อ จะถูกลบไปจากรายชื่อของคุณตลอดไป";
"Contacts.Delete.Title.Format.Multiple" = "ลบ %lu รายชื่อหรือไม่";
"Contacts.Delete.Description.Multiple" = "หากทำต่อ จะถูกลบไปจากรายชื่อของคุณตลอดไป";


// Contact UI Add Scene / Source
"Contacts_Source_Shake"			= "Shake";
"Contacts_Source_LBS"			= "คนที่อยู่ใกล้ ๆ";
"Contacts_Source_QRCode"        = "สแกน QR โค้ด";
"Contacts_Source_Chatroom"      = "เพิ่มจากกลุ่มแล้ว";
"PushContactLBS"                     = "จาก คนที่อยู่ใกล้ ๆ";
"PushContactShake"					 = "จาก Shake";
"PushContactBottle"					 = "จาก ข้อความในขวด";
"PushContactQRCode"                  = "จาก Shake";
"PushContactGoogleContact"           = "ผู้ติดต่อ Google";
"PushContactRadar"           = "Friend Radar";
"PushContacPush"                  = "เพื่อนใหม่";

// Share Namecard Sheet
"ShareNameCard.Heading" = "แชร์ \"%@\" ไปที่:";
"ShareNameCard.Confirm" = "ส่ง";

// Group Chat
"CreateChatRoom_MsgFormat" = "คุณได้เชิญ %@ มาที่กลุ่ม";
"CreateChatRoom_MsgSeperate" = "，";
"CreateChatRoom_DefaultTopic"	= "กลุ่ม";
"ChatRoom_ReservedTopicNames"	= "สนทนากลุ่ม";
"ChatRoom_NeedVerify" = "%@ ต้องเป็นเพื่อนของคุณเพื่อที่จะได้รับเชิญเข้ากลุ่มแชท ส่งคำขอเป็นเพื่อนก่อน";
"ChatRoom_Panel_Choose_Contact" = "เลือกผู้ติดต่อ";
"ChatRoom_Panel_Chosen_Num" = "%lu รายชื่อที่เลือก";
"ChatRoom_Panel_Has_Add" = "เลือกแล้ว";
"ChatRoom_Delete_Member_Fail" = "ไม่สามารถลบผู้ติดต่อนี้ได้";
"ChatRoom_Delete_Self" = "คุณไม่สามารถลบตัวเองจากกลุ่ม";
"ChatRoom_ChatRoomBeyondMax" = "คุณได้สร้างจำนวนสมาชิกกลุ่มไว้สูงสุดแล้ว";
"ChatRoom_TopicIllegal" = "ชื่อกลุ่มไม่ถูกต้อง";
"ChatRoom_Unkown_Failed" = "ไม่สามารถสร้างกลุ่ม";
"ChatRoom_ChatRoomMemberBeyondMax" = "กลุ่มนี้เต็มแล้ว ลบสมาชิกออกก่อนที่จะเพิ่มใหม่";
"ChatRoom_ChatRoomMemberNeedUpgrade" = "กลุ่มนี้เต็มแล้ว อัปเกรดขนาดของกลุ่ม";
"ChatRoom_NeedVerifyWait"  = "การเชิญเพื่อนของคุณเข้ากลุ่มถูกส่งแล้ว กรุณารอการอนุมัติจากเจ้าของของกลุ่ม";
"ChatRoom_NotExist" = "ไม่มีกลุ่มนี้.";
"ChatRoom_Status_Error" = "คุณไม่สามารถเชิญเพื่อนเข้ากลุ่มได้เนื่องจากมีข้อผิดพลาดเกิดขึ้น";
"ChatRoom_Error_NoUser" = "%@ ไม่มีอยู่";
"ChatRoom_Error_BlackList" = "%@ ปฏิเสธที่จะเข้าร่วมกลุ่ม";
"ChatRoom_Error_Verify" = "%@ ไม่ได้เป็นเพื่อน WeChat ของคุณ เพิ่มเข้าเป็นเพื่อนก่อน";
"NewMessage_ContactBeyondMaxTitle_Admin"= "กลุ่มเต็มแล้ว เรียนรู้เพิ่มเติมหรือไม่";
"NewMessage_ContactBeyondMaxTitle"= "ไม่สามารถเลือกผู้ติดต่อเพิ่มได้อีก";
"NewMessage_IlegalTopic"	     = "หัวข้อไม่ถูกต้อง ลองหัวข้ออื่น";

// Group Chat Invitation
"Group.Chat.Invitation.Error.Title" = "เข้าร่วมกลุ่ม";
"Group.Chat.Members.Error.Title" = "เพิ่มสมาชิก";
"Group.Chat.Members.Over.Limit" = "ไม่สามารถเลือกผู้ติดต่อเพิ่มได้อีก";
"Group.Chat.Members.Illegal.Topic" = "หัวข้อไม่ถูกต้อง ลองหัวข้ออื่น";
"Group.Chat.Members.Need.Verify" = "ส่งคำเชิญเป็นเพื่อนแล้ว รอการอนุมัติจากเจ้าของกลุ่ม";
"Group.Chat.Members.Not.Exist" = "ไม่มีกลุ่มอยู่";
"Group.Chat.Members.Status.Error" = "ไม่สามารถเชิญเพื่อนให้เข้าร่วมกลุ่มนี้";
"Group.Chat.Members.Group.Chat.Owner.To.Invite" = "กลุ่มเต็มแล้ว เจ้าของกลุ่ม (%@) สามารถเพิ่มจำนวนสมาชิกที่รองรับสำหรับกลุ่มนี้ได้ถึง %lu คน";
"Group.Chat.Members.Invite.Now" = "กลุ่มมีสมาชิกหลายคน ผู้ใช้ใหม่ต้องตอบรับคำเชิญของคุณเพื่อเข้าร่วมกลุ่ม เชิญตอนนี้หรือไม่";
"Group.Chat.Members.Invite" = "ชวนเพื่อน";
"Group.Chat.Members.Unknown.Issue" = "ระบบไม่ว่าง ลองอีกครั้งในภายหลัง";

// Viewer Window
"ViewerWindow.Title.Photo" = "รูปถ่าย";

// YO Message
"Yo.Message.Description" = " กำลังมองหาคุณ";

// Lock Screen
"Lock.Title" = "WeChat ถูกล็อค";
"Lock.Description" = "คุณสามารถปลดล็อคผ่านทาง 'Mac ของฉัน' ใน WeChat บนโทรศัพท์ของคุณ";
"Lock.Log.Out" = "ออกจากระบบ";
"Lock.Title.Network" = "ไม่มีเครื่อข่ายที่เชื่อมต่อได้";
"Lock.Description.Network" = "WeChat จะเชื่อมต่อเครือข่ายอีก เมื่อมีการตรวจพบ";
"Lock.Open.Mac.Helper" = "ปลดล็อคโทรศัพท์";
"Lock.Title.Network.Login" = "ตัดการเชื่อมต่อเครือข่ายแล้ว";
"Lock.Description.Network.Login" = "ตรวจสอบเครือข่ายและลองอีกครั้ง";
"Lock.Description.Network.Banner" = "เครือข่ายไม่พร้อมใช้งาน ตรวจสอบและลองใหม่อีกครั้ง";

// Mac Helper
"MacHelper.Active.Message" = "คุณล็อกอินบน %@ แล้ว";
"MacHelper.Main.Device.Name.Default" = "โทรศัพท์ของฉัน";
"MacHelper.Default.Message" = "คุณสามารถส่งข้อความและไฟล์ไปยังโทรศัพท์ของคุณในการแชทนี้";

// Harcode Contacts
"Official_MacHelper_NickName" = "โทรศัพท์ของฉัน";

// Notification
"Notification.Receive.Message" = "คุณได้รับข้อความ";

// Debug Strings
"Debug.Upload.Dump.Log" = "อัปโหลดบันทึกการล่าช้า";
"Debug.Upload.Success" = "อัปโหลดแล้ว";
"Debug.Upload.Uplloading" = "กำลังอัปโหลด...";
"Debug.Upload.Failed" = "ไม่สามารถอัปโหลดได้ ลองใหม่ในภายหลัง";

// MMPreview Panel
"PreviewPanel.Default.File.Name" = "ไฟล์ที่ไม่มีชื่อ";

// OA Message
"OAMessage.No.Article" = "ไม่มีบทความใหม่";

"TechSupport.Jietu.Title" = "Jietu";
"TechSupport.Jietu.Desc" = "โดย Jietu. \"Jietu\" คือแอปถ่ายสกรีนช็อตฟรีที่มีอินเทอร์เฟซที่ใช้งานง่าย";

// Chat Record
"ChatRecord.Video.Duration" = "%u วินาที";

// Whats New
"WhatsNew.title" = "WeChat สำหรับ Mac 2.2";
"WhatsNew.desc" = "1. สำรองข้อมูลบันทึกการสนทนาบนโทรศัพท์ไปที่ Mac ของคุณ\n2. แปลข้อความสนทนาเป็นภาษาอินเทอร์เฟซของคุณ\n3. ปรับปรุงคุณลักษณะการค้นหา\n4. ปรับรูปลักษณ์ของตัวอักษรขนาดใหญ่ให้เหมาะสม";
// Image Message Cell View
"Message.Image.Loading" = "กำลังโหลด…";
